
{
    "kind": "Property",
    "name": "RTCDataChannel.bufferedAmount",
    "href": "https://developer.mozilla.org/en-US/docs/Web/API/RTCDataChannel/bufferedAmount",
    "description": "The read-only RTCDataChannel property bufferedAmount returns the number of bytes of data currently queued to be sent over the data channel.",
    "content": "<p><strong>This is an <a href=\"https://developer.mozilla.org/en-US/docs/MDN/Contribute/Guidelines/Conventions_definitions#Experimental\">experimental technology</a></strong><br>Check the <a href=\"#Browser_compatibility\">Browser compatibility table</a> carefully before using this in production.</p>\n<p>The read-only <code>RTCDataChannel</code> property <code><strong>bufferedAmount</strong></code> returns the number of bytes of data currently queued to be sent over the data channel. The queue may build up as a result of calls to the <code>send()</code> method. This only includes data buffered by the user agent itself; it doesn't include any framing overhead or buffering done by the operating system or network hardware.</p>\n<p>The user agent may implement the process of actually sending data in any way it chooses; this may be done periodically during the event loop or truly asynchronously. As messages are actually sent, this value is reduced accordingly.</p>\n<div class=\"note\"> \n <p>Closing the data channel doesn't reset this count, even though the user agent purges the queued messages. However, even after closing the channel, attempts to send messages continue to add to the <code>bufferedAmount</code> value, even though the messages are neither sent nor buffered.</p> \n</div>\n<p>Whenever this value decreases to fall to or below the value specified in the <code>bufferedAmountLowThreshold</code> property, the user agent fires the <code><a href=\"https://developer.mozilla.org/en-US/docs/Web/Events/bufferedamountlow\" title=\"/en-US/docs/Web/Events/bufferedamountlow\">bufferedamountlow</a></code> event. This event may be used, for example, to implement code which queues more messages to be sent whenever there's room to buffer them.</p>"
}
