
{
    "name": "XRReferenceSpace.getOffsetReferenceSpace",
    "href": "https://developer.mozilla.org/en-US/docs/Web/API/XRReferenceSpace/getOffsetReferenceSpace",
    "description": "The XRReferenceSpace interface's getOffsetReferenceSpace() method returns a new reference space object which describes the relative difference in position between the object on which the method is called and a given point in 3D space.",
    "content": "<p><strong>Secure context</strong><br>This feature is available only in <a href=\"https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts\">secure contexts</a> (HTTPS), in some or all <a href=\"#Browser_compatibility\">supporting browsers</a>.</p>\n<p>The <code>XRReferenceSpace</code> interface's<code><strong>getOffsetReferenceSpace()</strong></code>method returns a new reference space object which describes the relative difference in position between the object on which the method is called and a given point in 3D space. The object returned by<code>getOffsetReferenceSpace()</code>is an <code>XRReferenceSpace</code> if called on an<code>XRReferenceSpace</code>, or an <code>XRBoundedReferenceSpace</code> if called on an object of that type.</p>\n<p>In other words, when you have an object in 3D space and need to position another object relative to that one, you can call<code>getOffsetReferenceSpace()</code>, passing into it the position and orientation you want the second object to have<em>relative to the position and orientation of the object on which you call<code>getOffsetReferenceSpace()</code></em>.</p>\n<p>Then, whendrawing the scene, you can use the offset reference space to not only position objects relative to one another, but to apply the needed transforms to render objects properly based upon the viewer's position. This is demonstrated in the example <a href=\"#Implementing_rotation_based_on_non-XR_inputs\">Implementing rotation based on non-XR inputs</a>, which demonstrates a way to use this method to let the user use their mouse to pitch and yaw their viewing angle.</p>"
}
