
{
    "name": "XRPose",
    "href": "https://developer.mozilla.org/en-US/docs/Web/API/XRPose",
    "description": "XRPose is a WebXR API interface representing a position and orientation in the 3D space, relative to the XRSpace within which it resides.",
    "content": "<p><strong>Secure context</strong><br>This feature is available only in <a href=\"https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts\">secure contexts</a> (HTTPS), in some or all <a href=\"#Browser_compatibility\">supporting browsers</a>.</p>\n<div class=\"blockIndicator draft\"> \n <p><strong>Draft</strong><br> This page is not complete.</p> \n</div>\n<p><code>XRPose</code> is a WebXR API interface representing a position and orientation in the 3D space, relative to the <code>XRSpace</code> within which it resides. The <code>XRSpace</code>—which is either an <code>XRReferenceSpace</code> or an <code>XRBoundedReferenceSpace</code>—defines the coordinate system used for the pose and, in the case of an <code>XRViewerPose</code>, its underlying views.</p>\n<p>To obtain the <code>XRPose</code> for the <code>XRSpace</code> used as the local coordinate system of an object, call <code>XRFrame.getPose()</code>, specifying that local <code>XRSpace</code> and the space to which you wish to convert:</p>\n<pre class=\"brush: js notranslate\">thePose = xrFrame.getPose(localSpace, baseSpace);</pre>\n<p>The pose for a viewer (or camera) is represented by the <code>XRViewerPose</code> subclass of <code>XRPose</code>. This is obtained using <code>XRFrame.getViewerPose()</code> instead of <code>getPose()</code>, specifying a reference space which has been adjusted to position and orient the node to provide the desired viewing position and angle:</p>\n<pre class=\"brush: js notranslate\">viewerPose = xrFrame.getViewerPose(adjReferenceSpace);</pre>\n<p>Here, <code>adjReferenceSpace</code> is a reference space which has been updated using the base frame of reference for the frame and any adjustments needed to position the viewer based on movement or rotation which is being supplied from a source other than the XR device, such as keyboard or mouse inputs<strong>.</strong></p>\n<p>See the article Movement, orientation, and motion for further details and an example with thorough explanations of what's going on.</p>",
    "properties": [
        "emulatedPosition",
        "transform"
    ]
}
